Tutorials-Foam-Extend-3.1/compressible/shockTube/shocktube_2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1000
(
68970
68970
68970
68970
68970
68970
68970
68970
...
)
;

boundaryField
{
    sides1
    {
        type            zeroGradient;
    }
    sides2
    {
        type            slip;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
